---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DpartShapeModified
source: html/2f414a57-3e73-8453-4e27-b19eb4f599d4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DpartShapeModified Property

"Shape is modified"

## Syntax (C#)
```csharp
public static ForgeTypeId DpartShapeModified { get; }
```